texts = []
texts.append("""Привет! Без комиссий и посредников! Предложение только для Женского пола. 
Неспешно ищу себе соседку в уютную однокомнатную квартиру в центре Москвы - район Пресненский , в 3 мин пешком от метро ул 1905 года. Проживать будем строго в двоем. К сожалению подойдёт мало кто , поэтому не расчитываю  на быстрый поиск . 
Обязательные пожелание :
-гражданка РФ
-постоянная работа вне дома со стандартным графиком 5/2
-не курящая , без животных 
- адекватная , интеллигентная 
Стоимость 19 Тр ( 38 Тр пополам ) + свет вода по счетчикам примерно 1000 р -+250 безлимитный интернет если он не обходим . Депозит за последний месяц проживания 19 Тр ( можно разбить на 2 месяца). 
В доме имеется лифт и все необходимое для комфортного проживания . У вас будет отдельное спальное  место ( большой раскладной диван см фото ) , отдельные шкафы , Полки. Дом оснащён лифтом .
Все подробности в личные сообщения в Вотс ап . Посредникам и лицам мужского пола прошу не беспокоить! +79680835929
Всем добра! ☀️""")
texts.append("""Всем привет:) 
Ищу квартиру в районе метро Университет/проспект Вернадского/новые Черёмушки. 
Бюджет до 50тыс. 
О себе: буду жить одна, платёжеспособна, имеется домработница.""")
texts.append("""Фото выше^^^

Добрый день)

Сдаю просторную двушку.

- ️О квартире
Квартира просторная. Две изолированные комнаты. Одна из комнат с застекленным балконом (на балкон выведена розетка). Изолированный санузел.
Был сделан легкий косметический ремонт, установлен новый санузел. Я не против купить дополнительную мебель и провести прочие ремонтные работы (поклеить другие обои, заменить полы на кухне, убрать лишнюю мебель и так далее), но это нужно будет обговорить.

Одна комната солнечная, другая, наоборот, темнее. Вид с балкона на ухоженную аллею. Сам дом новый, с красивым подъездом. Этаж 3.

-️ Метро и инфраструктура
В 12-15 минутах пешком от метро Братиславская. Рядом с домом парки, прудики, магазины, аптеки, почта, поликлиника с хорошим ремонтом и спортзал. У метро несколько неплохих торговых центров, а также легко добраться на общественном транспорте до Меги Белая дача (минут 15-30, в зависимости от пробок).

- ️Дополнительно
Можно с питомцами.
Будет договор на аренду.

- Оплата
50 тысяч за всю квартиру + ку (вода, электричество). Торг уместен) 
Залог 50 тысяч, но его можно обговорить и разбить.

Можно снять только комнату и, по желанию, поучаствовать в поиске соседей""")

texts.append("""Добрый день!

По согласованию с собственником, сдаётся комната в 2-х комнатной квартире. 
В квартире не курят.
Есть всё необходимое.

Адрес: 2-я Квесисская ул., д.25, это между м.Динамо и м.Савеловская. 

На длительный срок.

Цена: 26т.р.+ку. 
Залог можно разбить на несколько месяцев.

Пишите https://t.me/tycer""")

texts.append("""Сдадим место для парня и девушки  в квартире у м.Беговая (10 минут пешком)

В чем наши преимуществ?

- мы отличаемся от формата хостела, т.к. заселяем жителей только на длительный(!) срок;
- ты всегда будешь чувствовать себя в безопасности, мы гарантируем порядочность твоих будущих соседей;
- если что-то сломалось - это не беда! Мы полностью берем на себя задачи по устранению неполадок в квартире.
 
Наши основные принципы - это взаимное уважение, соблюдение личных границ, соблюдение графика дежурств и отсутствие вредных привычек в рамках квартиры. 
 
Цена - 11 500₽ + ку(около 600₽)
В первый месяц скидка - 1000₽
 
Есть вопросы? - Пиши https://vk.com/id551222822""")
